Repository: weetgo/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/material_library.po
Languages: ru

source: Material Library
ru: Библиотека материалов

source: Table of Contents
ru: Содержание

source: The material library is a library where a user can find basic and the most commonly used materials to use in his or her projects or create his or her own materials based on these materials.
ru: Библиотека материалов – это библиотека, где пользователь может найти базовые и наиболее часто используемые материалы для использования в своих проектах или для создания на их базе своих собственных материалов.

source: When creating a new project, you can plug the material library into it, and then plug in materials directly from there.
ru: При создании нового проекта возможно перенести библиотеку материалов в новый проект автоматически и подключать материалы оттуда.

source: To do this, check the ``Use Material Library`` box when creating the project using the :ref:`Project Manager <project_management>`. Then, an entire material library will be automatically copied to the ``/assets/material_library/`` folder in the new project’s directory.
ru: Для этого при создании нового проекта при помощи :ref:`менеджера проектов <project_management>` надо выставить галочку ``Use Material Library``. Тогда вся библиотека материалов будет автоматически скопирована в папку ``/assets/material_library/`` в каталоге нового проекта.

source: It is also possible to use Material Library in a pre-existing project. All you have to do is copy files from the ``/blender/material_library/`` folder to the ``/assets/`` folder in your project’s directory. Then you can link the files that contain materials you need to your scene file and use them in the scene.
ru: Библиотека материалов может использоваться и в уже существующем проекте. Для этого достаточно скопировать файлы из папки ``/blender/material_library/`` в каталоге SDK в папку ``/assets/`` в каталоге проекта. После этого файлы материалов можно подключить к файлу сцены и использовать материалы в сцене.

source: Materials (or any other objects) can be both *linked* or *appended* to the scene. The difference is described :ref:`here <material_add>`.
ru: Как и любые объекты, материалы можно добавлять к сцене с помощью команд ``Link`` и ``Append``. Разница между ними описана :ref:`здесь <material_add>`.

source: Library Structure
ru: Структура библиотеки

source: All materials are structured by folder (by categories of materials) and by a separate file (by materials). Every blend file contains one base material and a material for an additional object, that demonstrates the material on an object that can be associated with this material (for example, a gold ingot for a gold material).
ru: Все материалы структурированы по папкам (по группам материалов) и отдельным файлам (по материалам). В каждом blend-файле находится один базовый материал (например ``bronze``) и материал на дополнительном объекте (например ``happy_recon_bronze``), который позволяет демонстрировать материал на характерном объекте, ассоциирующимся с данным материалом (например: материал золото — золотой слиток).

source: Material Structure
ru: Структура материала

source: The core of the material
ru: Ядро материала

source: The ``Material`` node which receives all valuable information from the core.
ru: Нода ``Material``, в которую подается вся нужная информация из ядра материала.

source: The normal map that can be plugged into any material core.
ru: Карта нормалей, которую при необходимости можно подключить к любому ядру материала.

source: Texture containing additional masks important for the material on the surface of the object to behave correctly. Most materials use the following masks:
ru: Текстура с необходимыми дополнительными масками для задания корректного поведения материала на поверхности объекта. В большинстве материалов использованы следующие маски:

source: Ambient occlusion map
ru: Карта затенения

source: Dirt map
ru: Карта загрязнения

source: Worn map
ru: Карта потёртостей

source: Patina map
ru: Карта патины

source: These masks are not used in every material, only when they are needed for the shader to appear a specific way.
ru: Не все из них используются в каждом материале, только если требуется для создания корректного поведения того или иного шейдера.

source: The ``Mapping`` node is used to control the parameters of the UV maps.
ru: Нода ``Mapping``, регулирующая параметры UV-развертки.

source: The ``RGB Curve`` nodes can be used to correct masks before plugging them into the material core.
ru: Ноды ``RGB Curve``, позволяющие корректировать те или иные маски прежде чем они будут поданы в ядро материала.

source: Specific specular map settings are used right after the ``Material`` node to achieve various degrees of specular blur.
ru: Специфическая настройка карты спекуляра после ноды ``Material``, для создания разной степени размытости блеска с использованием масок.

source: The baked ambient occlusion map is added to the shader right before the Output node.
ru: Запеченная карта затенения добавляется к шейдеру перед нодой ``Output``.

source: The ``Output`` node.
ru: Нода ``Output``

source: Material Core
ru: Ядро материала

source: This is the main node group containing the node structure that form a shader. Essentially, this is the material itself in its true form, with all complex node interactions packed into one group for convenient use. This node group has certain inputs and outputs, as well as specific input parameters, to set it up.
ru: Основная нодовая группа, которая содержит нодовую структуру, формирующую шейдер. Это по сути и есть сам материал в его чистом виде, все сложные взаимодействия нодовых узлов упакованы в одну группу для удобного использования. Для её настройки нодовая группа имеет специальные входы и выходы, а так же специфические вводные параметры.

source: An Example of Using a Material
ru: Пример использования

source: Here, you can see an example of setting plastic material for a special demo object without using the textures that are plugged into the core of the material.
ru: Здесь вы можете видеть пример настройки материала пластика на специальном демонстрационном объекте без использования текстур, подключаемых в ядро материала.

source: The base color is created with a simple ``RGB`` Color node and plugged to the material core input.
ru: Базовый цвет задан простой нодой ``RGB Color`` и подан на вход в ядро материала.

source: This implementation of the material does not use any normal maps, so geometry data is plugged to the ``Normal`` input.
ru: В данной реализации материала не используется никаких карт нормалей и во вход ``Normal`` поданы данные нормалей с геометрии.

source: The core of the material has a certain parameter that controls the amount of gloss on the material. In this case, the value of this parameter is set to maximum.
ru: В данном ядре материала присутствует специфическая настройка, регулирующая уровень глянца на материале. В данном случае значение выставлено на максимум.

source: The material also uses a baked ambient occlusion map.
ru: Также в материале используется запеченная маска затенения.

source: Now, let's take a look at a case of using the same material on a different object — a plastic gamepad.
ru: Теперь рассмотрим использование того же материала на другом объекте - пластиковом джойстике.

source: The vertex color from the geometry of the object is used as the base color here.
ru: В качестве цвета здесь используется вертексный цвет с геометрии объекта.

source: A normal map has been baked for the geometry of the gamepad, and connected to the ``Normal`` input of the material core.
ru: Для геометрии джойстика была запечена карта нормалей, которая подана во вход ``Normal`` ядра материала.

source: The level of gloss is lower.
ru: Уровень глянца объекта настроен на меньшее значение.

source: Instead of the masks from the demo model, the masks (ambient occlusion and dirt) baked specifically for the gamepad model are used.
ru: Вместо масок демонстрационной модели используются маски (загрязнения и затемнения), запеченные специально для модели джойстика.

source: It should be noted that the material core hasn't changed and was not altered to fit different geometry.
ru: Следует заметить, что содержимое ядра материала не менялось и не корректировалось под другую геометрию.

source: Adding Material to a Scene
ru: Добавление материала в сцену

source: How to Add a Whole Material
ru: Добавление целого материала

source: Select the ``File > Append/Link`` from the menu, depending on what you want to do. If you want to keep the ability to modify the object after it has been added to the scene, use ``Append``. If you don't, use ``Link``.
ru: Выберете в меню ``File`` пункт ``Append`` или ``Link``, в зависимости от того что вы хотите сделать - добавить объект полностью в ваш проект с возможностью изменять его (в этом случае выберите ``Append``) или только прилинковать без необходимости изменений (в этом случае выберите ``Link``).

source: Then select the blend file containing the material you need from the ``/blend4web/blender/material_library/`` directory.
ru: Далее выберите интересующий вас .blend-файл с материалом из директории ``/blend4web/blender/material_library/``

source: Select the material itself from the list of materials, and press ``Append from Library`` or ``Link from Library``. Now, the material has been added to your scene and can be used on any object.
ru: Выберите сам материал в списке материалов и нажмите ``Append from Library`` или ``Link from Library``. Теперь материал добавлен в вашу сцену и вы можете применить его к любому из объектов.

source: How to Add Only a Material Core
ru: Добавление только ядра материала

source: If you want to add only the core of the material and set everything else yourself, then, instead of selecting material, select ``NodeTree`` while linking/appending, then select the node group you need, and press ``Append from Library`` or ``Link from Library``.
ru: Если вы хотите добавить только ядро материала, а остальную часть настроить самостоятельно, при линковке или добавлении вместо материала выберите ``NodeTree`` и, выбрав интересующую вас нодовую группу, нажмите ``Append from Library`` или ``Link from Library``.

source: Now this node group can be found in the list of node groups that you can add to your material by clicking **Add=>Group** in the Node Editor interface.
ru: Теперь эта нодовая группа находится в списке нодовых групп которые вы можете добавить в свой материал через **Add=>Group** в окне Node Editor.

source: Every material has its own requirements considering not only masks and textures, but also vertex colors and UV maps.
ru: У любого материала есть свои требования не только в отношении определенных масок и текстур, но и вертексных цветов и UV-разверток.
