Repository: weetgo/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/postprocessing_effects.po
Languages: ru, zh

source: Postprocessing Effects
ru: Спецэффекты
zh: 后期处理效果

source: Table of Contents
ru: Содержание
zh: 目录

source: Motion Blur
ru: Размытие при движении
zh: 运动模糊

source: The motion blur effect can be used to improve the realism of an interactive scene. It is displayed as picture blurring when the camera or objects move.
ru: Эффект размытия при движении (motion blur) служит целям увеличения реализма интерактивной сцены. Он проявляется при движении камеры или объектов в виде "смазывания" изображения.
zh: 运动模糊效果可以用来改善交互式场景的真实感。当相机或物体移动，显示为画面模糊。

source: Activation
ru: Активация
zh: 激活

source: Activate the ``Motion Blur`` panel on the ``Render`` tab.
ru: Активировать панель ``Motion Blur`` во вкладке ``Render``.
zh: 激活 ``Render`` 选项卡上的 ``Motion Blur`` 面板。

source: Additional settings
ru: Дополнительные настройки
zh: 其他设置

source: *Factor*
zh: *因子*

source: Effect appearance ratio. The higher this value is the stronger is the motion blur.
ru: Степень проявления эффекта. Чем выше значение, тем сильнее эффект размытия. Значение по умолчанию 0.01.
zh: 外观的影响比例。此值越高越强的运动模糊。

source: *Decay Threshold*
zh: *衰减阈值*

source: Blur fade-out ratio. The higher this value is the more distinct is the effect. The default value is 0.01.
ru: Степень плавности размытия. Чем выше значение, тем более резким будет эффект. Значение по умолчанию 0.01.
zh: 模糊淡出率。较高的这个值有更鲜明的效果。默认值是0.01。

source: Depth of Field
ru: Глубина резкости камеры
zh: 景深

source: The depth of field effect (DOF) can be used to accentuate a part of a scene. It is displayed as picture blurring nearer and further from the camera focus.
ru: Эффект глубины резкости камеры (depth of field, DOF) акцентирует внимание зрителя на части сцены. Проявляется в размытии изображения ближе и дальше от фокуса камеры.
zh: 场景深度效应（DOF）可以用于强调场景的一部分。从相机对焦点之外的地方开始图像模糊 。

source: Select an active camera and go to its settings panel ``Camera`` (``Object Data``).
ru: Выбрать активную камеру, перейти на панель ее настроек во вкладке ``Camera`` (``Object Data``).
zh: 选择一个主控摄像头，并转到它的设置面板 ``Camera`` (``Object Data``).

source: Then two options are available:
ru: Далее возможны два варианта:
zh: 然后有两种选择：

source: Select an object to use as the camera's focus in the ``Focus`` option of the ``Depth of Field`` panel. In this case moving away or approaching this object will cause a corresponding correction of the camera focus.
ru: На панели ``Depth of Field`` в опции ``Focus`` выбрать объект, на котором будет сфокусирована камера. В этом случае при удалении или приближении к этому объекту будет происходит соответствующая коррекция фокуса камеры.
zh: 在 ``Depth of Field`` 面板的 ``Focus`` 选项选择一个物体作为相机的对焦点。在这种情况下移动或接近这个物体，会导致相机的焦点相应的修正。

source: Set a non-zero value for the ``Distance`` on the same panel (in Blender units = meters). In this case the camera focus will be located at this distance from the camera and will move together with it.
ru: На той же панели установить ненулевое значение ``Distance`` (в метрах). В этом случае фокус камеры будет располагаться на заданном расстоянии от камеры и перемещаться вместе с ней.
zh: 同一面板上为 ``Distance`` 设置一个非零值（Blender中单位=米）。在这种情况下，相机焦点在相机的这个距离值，并与相机一起移动。

source: Additional Settings
ru: Дополнительные настройки
zh: 附加设置

source: *Focus*
zh: *焦点*

source: Sets the focal object. By default, this field is empty.
ru: Задаёт объект, на котором фокусируется камера. Это поле пусто по умолчанию.
zh: 设置的重点对象。默认情况下，此字段为空。

source: *Distance*
zh: *距离*

source: This parameter defines the focal distance. Available only if the ``Focus`` parameter hasn't been set beforehand (if the corresponding field is empty). Set to zero by default.
ru: Задаёт расстояние фокусировки. Этот параметр доступен только в том случае, если не установлен параметр ``Focus`` (соответствующее поле пусто). По умолчанию расстояние до точки фокуса равно нулю.
zh: 此参数定义焦距。仅当 ``Focus`` 参数没有预先设置（如果相应的字段为空）有用。默认设置为零。

source: *Front Start*
zh: *前端起始*

source: This sets the distance (in meters) from the focus to the nearest plane (relative to the camera) behind which blurring effect starts to occur. The default value is 1.0.
ru: Задаёт расстояние (в метрах) от фокуса до ближней к камере плоскости, за которой начинает проявляться эффект размытия. Значение по умолчанию 1.0.
zh: 此选项设置（以米为单位） 焦点到最近的平面到模糊效应开始出现前的距离（相对于相机） 。默认值是 1.0。

source: This parameter is available only if the ``High Quality (Bokeh)`` parameter is enabled.
ru: Этот параметр доступен только при включённой опции ``High Quality (Bokeh)``.
zh: 只有启用了 ``High Quality (Bokeh)`` 参数，此参数才可用。

source: *Front End*
zh: *前端结束*

source: This sets the distance from the camera and the nearest plane (relative to the camera) behind which blurring effect reaches maximum strength (defined by the ``Power`` value). Default value is 5.0.
ru: Задаёт расстояние (в метрах) от фокуса до ближней к камере плоскости, за которой происходит полное размытие (сила размытия задаётся параметром ``Power``). Значение по умолчанию 5.0.
zh: 这个设置从相机和最近平面 （相对于相机） 背后的模糊效果达到最大强度 （由 ``Power`` 的值定义） 的距离。默认值为 5.0。

source: *Rear Start*
zh: *后方开始*

source: This sets the distance from the focus to the furthest plane (relative to the camera) behind which blurring effect starts to occur. The default value is 1.0.
ru: Задаёт расстояние (в метрах) от фокуса до дальней от камеры плоскости, за которой начинает проявляться эффект размытия. Значение по умолчанию 1.0.
zh: 这设置从焦点到最远的平面（相对于相机）的距离，模糊效果开始发生。默认值为1.0.

source: *Rear End*
zh: *后方结束*

source: This sets the distance from the camera to the furthest plane (relative to the camera) behind which blurring reaches maximum strength (defined by the ``Power`` value). Default value is 5.0.
ru: Задаёт расстояние (в метрах) от фокуса до дальней от камеры плоскости, за которой происходит полное размытие (сила размытия задаётся параметром ``Power``). Значение по умолчанию 5.0.
zh: 这设置从相机到最远的平面（相对于相机）的距离，模糊达到最大强度（由 ``Power`` 的值定义）。默认值为5.0。

source: *Power*
zh: *指数*

source: Blurring ratio. The value of this parameter can vary from 0.1 to 10. The default value is 2.0.
ru: Сила размытия. Этот параметр может принимать значения от 0.1 до 10. Значение по умолчанию - 2.0.
zh: 模糊的比率。此参数的值可从 0.1 至 10。默认值为 2.0。

source: *High Quality (Bokeh)*
zh: *高品质（背景虚化）*

source: This enables high quality rendering of the depth of field effect. Activating this option:
ru: Включает высококачественный рендеринг эффекта глубины резкости. Активация этого параметра:
zh: 这使得高质量渲染景深效果。激活此选项︰

source: Enables bokeh effect and makes available the ``Bokeh Intensity`` parameter for adjusting the strength of the effect.
ru: Включает эффект боке и опцию ``Bokeh Intensity``, которая может применяться для настройки силы этого эффекта.
zh: 启用的散景效果，并使 ``Bokeh Intensity`` 参数可用来调整影响强度。

source: Enables the ``Front Start`` and ``Rear Start`` parameters for setting soft transition between the distance from camera where the effect start to occur and the distance where it reaches its full strength.
ru: Включает параметры ``Front Start`` и ``Rear Start``, предназначенные для установки мягкого перехода между расстоянием от камеры, за которым эффект размытия начинает проявляться, и расстоянием, за которым он достигает максимальной силы.
zh: 启用 ``Front Start`` 和 ``Rear Start`` 参数设置从相机里的影响开始发生软过渡之间的距离，它达到其全部的力量的距离。

source: Enables ``Foreground Blur`` parameter that is described below.
ru: Включает параметр ``Foreground Blur``, описанный ниже.
zh: 启用 ``Foreground Blur`` 的参数，如下所述。

source: The parameter is disabled by default.
ru: По умолчанию этот параметр деактивирован.
zh: 参数默认被禁用的。

source: *Bokeh Intensity*
zh: *散景强度*

source: This value sets the strength of the bokeh effect. It can vary from zero to 1.0. Set to 0.3 by default.
ru: Устанавливает силу эффекта боке. Значение может меняться от 0 до 1, значение по умолчанию - 0.3.
zh: 此值设置的散景效果的强度。它可以从 0 到 1.0 会发生变化。默认设置为 0.3。

source: *Foreground Blur*
zh: *前景模糊*

source: Enabling this option makes the engine to blur the silhouettes of the foreground objects, improving the quality of the effect at the cost of slight performance decrease. Disabled by default.
ru: При включении этого параметра движок размывает границы объектов, находящихся на переднем плане, увеличивая качество эффекта размытия за счёт некоторого снижения производительности. По умолчанию отключен.
zh: 启用此选项使引擎模糊前景物体的轮廓，提高质量的代价是性能略有降低作用。默认为禁用。

source: Screen-Space Ambient Occlusion
ru: Взаимное затенение
zh: 屏幕空间环境光遮蔽

source: The screen-space ambient occlusion (SSAO) effect can be used to fake complex light reflections from objects. The basis of this effect is that the space between close objects is less accessible for diffused light and hence is darker.
ru: Эффект взаимного затенения (screen-space ambient occlusion, SSAO) применяется с целью воспроизведения сложного переотражения света от объектов. Пространство между близкими объектами менее доступно для рассеянного света и поэтому затеняется сильнее.
zh: 屏幕空间环境光遮蔽（SSAO）效果，可用于仿造在物体周围复杂的光线反射。这种效果的基础是，近处的物体之间的空间为漫射光不易进入的，因而是更暗。

source: Activate the ``Ambient Occlusion SSAO`` panel under the ``Render`` tab and set the ``Render Shadows`` parameter to ``AUTO`` or ``ON`` on the ``Render > Shadows`` panel.
ru: Активировать панель ``Ambient Occlusion (SSAO)`` во вкладке ``Render`` и выставить параметр опции ``Render Shadows`` в положение ``AUTO`` или ``ON`` на панели ``Render > Shadows``.
zh: 激活 ``Render`` 标签下 ``Ambient Occlusion SSAO`` 面板，在 ``Render > Shadows`` 面板设置 ``Render Shadows`` 到参数 ``AUTO`` 或 ``ON`` 。

source: *Radius Increase*
zh: *半径增加*

source: The spherical sampling radius multiply factor when transferring from the internal sampling ring to the external one. The default value is 3.0.
ru: Фактор умножения радиуса сферического сэмплинга при переходе от внутреннего кольца к внешнему. Значение по умолчанию 3.0.
zh: 从内部采样环到外部采样环的球形采样半径的乘法系数。默认值是3.0。

source: *Use Hemisphere*
zh: *使用半球*

source: Use a hemispherical sampling for shading instead of a spherical. Besides, it uses different shading law.
ru: Использовать для расчёта затенения полусферический сэмплинг вместо сферического. Помимо этого используется другой закон затенения.
zh: 使用半球形采样着色，而不是球形。它使用不同的着色方法。

source: *Use Blur Depth Test*
zh: *使用模糊深度测试*

source: Use edge-preserving blur to SSAO if flag will be turned on. Otherwise, it uses blur which averages a 4x4 rectangle around each pixel.
ru: Если активировано - используется размытие SSAO на основе буфера глубины. Иначе - размытие по квадрату 4х4 по соседним пикселям.
zh: 使用边缘保持模糊到SSAO如果标志将被打开。否则，它采用模糊平均为每个像素周围的4×4的矩形。

source: *Blur Depth Test Discard Value*
zh: *模糊深度测试丢弃值*

source: Influence of depth difference between samples on blur weight. It uses with ``Use Blur Depth Test`` activated flag. The default value is 1.0.
ru: Влияние разницы глубины сэмплов на их вес в размытии. Используется при активированном параметре ``Use Blur Depth Test``. Значение по умолчанию 1.0.
zh: 对模糊量的采样之间的深度差异的影响。它采用 ``Use Blur Depth Test`` 启动标志。缺省值为1.0。

source: *Influence*
zh: *影响*

source: SSAO appearance factor. The default value is 0.7.
ru: Степень проявленности эффекта взаимного затенения. Значение по умолчанию 0.7.
zh: SSAO外观系数。默认值是0.7。

source: *Distance Factor*
zh: *距离系数*

source: Factor of SSAO decay with distance. The default value is 0.0 (i.e. no decay).
ru: Фактор уменьшения проявленности эффекта взаимного затенения с расстоянием. Значение по умолчанию 0.0 (т.е. уменьшения нет).
zh: SSAO衰减的距离系数。默认值是0.0（即没有衰减）。

source: *Samples*
zh: *采样*

source: Number of samples (the more samples there are the better is the quality but the poorer is the performance). The default value is 16.
ru: Количество сэмплов (чем больше, тем лучше качество, но меньше производительность). Значение по умолчанию 16.
zh: 采样数（越多采样有更好的是质量，但较差是性能）。默认值是16。

source: God Rays
ru: Сумеречные лучи
zh: 上帝光芒

source: The god rays effect (aka crepuscular rays) simulates well-known natural phenomenon - the shining of illuminated air parts.
ru: Эффект сумеречных лучей (crepuscular rays, "god rays") симулирует известное природное явление - свечение освещенных областей воздуха.
zh: 神光芒的效果（又名曙暮辉）模拟著名的自然现象 - 空气照明部分的闪耀。

source: Activate the ``God Rays`` panel under the ``Render`` tab.
ru: Активировать панель ``God Rays`` во вкладке ``Render``.
zh: 激活 ``Render`` 选项卡下的 ``God Rays`` 面板。

source: *Intensity*
zh: *强度*

source: The effect appearance factor. The default value is 0.7.
ru: Степень проявленности эффекта. Значение по умолчанию 0.7.
zh: 影响外观的系数。默认值是0.7。

source: *Maximum Ray Length*
zh: *最大长度光线*

source: Rays length factor. Defines the step between samples of radial blurring. The default value is 1.0.
ru: Фактор длины лучей. Определяет шаг сэмплов радиального размытия. Значение по умолчанию 1.0.
zh: 光线长度的系数。限定径向模糊的样本之间的步长。缺省值为1.0。

source: *Steps Per Pass*
zh: *每通道步值*

source: Number of steps per single sample. The default value is 10.0.
ru: Количество шагов на один сэмпл. Значение по умолчанию 10.0.
zh: 每个单个样本步长。默认值是10.0。

source: Bloom
ru: Эффект засветки ярких деталей
zh: 泛光效果

source: Bloom appears when a picture has elements with a very different brightness. A glowing halo is created around the bright details.
ru: Эффект засветки (Bloom) проявляется при наличии на экране элементов с большой разницей в яркости. Вокруг ярких деталей создается светящийся ореол.
zh: 泛光出现在画面中有一个非常不同的亮度元素。生成一个发光的光环围绕着明亮的细节。

source: Activate the ``Bloom`` panel under the ``Render`` tab.
ru: Активировать панель ``Bloom`` во вкладке ``Render``.
zh: 激活 ``Render`` 选项卡下的 ``Bloom`` 面板。

source: *Use Adaptive*
zh: *使用自适应*

source: Use calculation of adaptive average luminance. Enabled by default.
ru: Включает расчёт адаптивной средней яркости. По умолчанию включено.
zh: 使用自适应平均亮度的计算。默认启用。

source: Bloom intensity. Set to 1.0 by default.
ru: Интенсивность засветки. По умолчанию равна 1.0.
zh: 泛光强度。默认设置为1.0。

source: *Blur*
zh: *模糊*

source: Bloom blurriness factor. Set to 4.0 by default.
ru: Степень размытия засветки. По умолчанию равна 4.0.
zh: 泛光模糊的系数，默认设置为4.0。

source: *Edge Luminance*
zh: *边缘亮度*

source: The boundary value of an element's relative brightness above which the bloom effect appears. Set to 1.0 by default.
ru: Граничное значение относительной яркости элемента, выше которого начинает проявляться эффект засветки. По умолчанию равно 1.0.
zh: 元素的相对亮度的边界值，高于其的亮度时泛光效果出现。默认设置为1.0。

source: Outlining
ru: Подсветка контура (outlining)
zh: 物体外轮廓

source: As a result of the outline glow effect, a luminous colored halo will be displayed around the object.
ru: В результате применения эффекта подсветки контура вокруг объекта появляется светящийся ореол произвольного цвета.
zh: 作为轮廓辉光效应，围绕物体显示发光的光晕。

source: The outlining is activated programmatically via API. Different animation models can be applied such as constant glow, fading out glow, pulsatory glow and any other. In order to enable the outlining effect on a certain object, make sure that the ``Render > Object Selection`` panel's ``Enable`` property is set to ``ON`` or ``AUTO``.
ru: Эффект подсветки контура активируется программно через API. Может быть реализован как эффект постоянного свечения, так и затухающего, пульсирующего и любой другой модели. Для включения возможности подсветки объектов необходимо убедиться, что в панели ``Render > Object Selection`` поле ``Enable`` установлено в состояние ``ON`` или ``AUTO``.
zh: 外轮廓是通过API编程激活。不同的动画模型可以应用，如不断晕光，淡出的光晕，光晕脉动和任何其他。为了使某一物体上勾勒的效果，确保 ``Render > Object Outlining`` 面板的 ``Enable`` 属性设置为 ``ON`` 或 ``AUTO`` 。

source: On the ``Object > Selection and Outlining`` panel:
ru: На панели ``Object > Selection and Outlining``:
zh: 在 ``Object > Selection and Outlining`` 面板：

source: *Enable Outlining*
zh: *启用外轮廓*

source: Permit using the outline glow effect on this object.
ru: Разрешить использование эффекта подсветки контура на конкретном объекте.
zh: 允许使用此物体的轮廓发光效果。

source: *Duration*
zh: *持续*

source: Duration of glow animation, seconds. The default value is 1.
ru: Длительность анимации подсветки, сек. Значение по умолчанию 1.
zh: 辉光动画的持续时间，单位为秒。默认值是1。

source: *Period*
zh: *周期*

source: Repeat period of glow animation, seconds. The default value is 1.
ru: Период повторения анимации подсветки, сек. Значение по умолчанию 1.
zh: 辉光动画的重复周期，单位为秒。默认值是1。

source: *Relapses*
zh: *重复*

source: The number of iterations of glow animation. If zero, animation is repeated forever. The default value is 0.
ru: Количество итераций анимации подсветки. В случае 0 анимация будет повторяться бесконечно. Значение по умолчанию 0.
zh: 辉光动画迭代次数。如果为零，动画将永远重复。缺省值是0。

source: *Outline on Select*
zh: *选择时外轮廓*

source: Activate glow animation upon selecting the object. In this case the ``Selectable`` option must be enabled. In case of a user-defined glow animation model, this option must be disabled in order to avoid conflict.
ru: Активация анимации подсветки при выделении объекта. Для данного случая необходимо включить опцию ``Selectable``. При необходимости реализации собственной модели подсветки объекта следует отключить эту опцию во избежание конфликта.
zh: 在选择物体时激活辉光动画。在这种情况下，``Selectable`` 选项必须启用。在用户定义的辉光动画模型的情况下，以避免冲突此选项必须被禁用。

source: On the ``Render > Object Outlining`` panel:
ru: На панели ``Render > Object Outlining``:
zh: 在 ``Render > Object Outlining`` 面板：

source: When this parameter decreases so does the thickness and the brightness of the halo around the object. The default value is 1.
ru: Толщина и яркость ореола, окружающего объект. Падает с уменьшением параметра. Значение по умолчанию 1.
zh: 当这个参数减小围绕物体的辉光的厚度亮度也减小。默认值是1。

source: The ``Render > Object Outlining`` settings are taken as default when the glow effect is initiated via API.
ru: При управлении через API настройки на панели ``Render > Object Outlining`` воспринимаются как настройки по умолчанию.
zh: 当通过API初始化辉光效果时 ``Render > Object Outlining`` 被作为默认值。

source: Glow
ru: Свечение (glow)
zh: 晕光

source: Effect of halo which is observed around emissive objects due to light scattering in the atmosphere and inside the human eye.
ru: Эффект возникновения ореола вокруг светящихся объектов, возникающий вследствие рассеивания света в атмосфере и внутри человеческого глаза.
zh: 晕光的效果是通过观测发射光的物体在大气中的光散射进入人眼内后的成像。

source: Add a :ref:`B4W_GLOW_OUTPUT <glow_output>` node to a node material. The ``Enable Glow Materials`` option on the ``Render > Glow Materials`` panel should be set to ``ON`` or ``AUTO``.
ru: Добавить в нодовый материал ноду :ref:`B4W_GLOW_OUTPUT <glow_output>`. Для включения возможности свечения в панели ``Render > Glow Materials`` опция ``Enable`` должна быть установлена в состояние ``ON`` или ``AUTO``.
zh: 添加 :ref:`B4W_GLOW_OUTPUT <glow_output>` 节点到节点材质。在 ``Render > Glow Materials`` 面板的 ``Enable Glow Materials`` 选项应设置为 ``ON`` 或 ``AUTO`` 。

source: *Small Mask: Intensity*
zh: *小遮罩：强度*

source: Intensity of glow obtained through the smaller mask. The default value is 2.0.
ru: Интенсивность свечения по малой маске. Значение по умолчанию 2.0.
zh: 通过较小的遮罩晕光获得的强度。默认值是2.0。

source: *Small Mask: Width*
zh: *小遮罩：宽*

source: Width of glow obtained through the smaller mask. The default value is 2.0.
ru: Ширина свечения по малой маске. Значение по умолчанию 2.0.
zh: 通过较小的遮罩晕光获得的宽度。默认值是2.0。

source: *Large Mask: Intensity*
zh: *大遮罩：强度*

source: Intensity of glow obtained through the larger mask. The default value is 2.0.
ru: Интенсивность свечения по большой маске. Значение по умолчанию 2.0.
zh: 通过较大遮罩晕光获得的强度。默认值是2.0。

source: *Large Mask: Width*
zh: *大遮罩：宽*

source: Width of glow obtained through the larger mask. The default value is 6.0.
ru: Ширина свечения по большой маске. Значение по умолчанию 6.0.
zh: 通过较大遮罩晕光获得的宽度。默认值是6.0。

source: *Render Glow Over Transparent Objects*
zh: *在透明的物体渲染辉光*

source: Render the glow effect over transparent objects.
ru: Отрисовывание эффекта свечения поверх прозрачных объектов. По умолчанию выключено.
zh: 渲染透明物体的辉光效果。

source: Anti-Aliasing
ru: Сглаживание
zh: 抗锯齿

source: Anti-aliasing is used to reduce undesirable rendering artifacts (poor pixelization).
ru: Сглаживание (anti-aliasing) необходимо для уменьшения влияния нежелательных артефактов рендеринга ("зубчатости").
zh: 抗锯齿用于减少不良渲染表现（像素化差）。

source: Select quality profile using ``AA Quality`` menu located on the ``Render > Anti-Aliasing`` panel.
ru: Выбрать один из профилей качества в поле ``AA Quality`` на панели ``Render > Anti-Aliasing``:
zh: 使用位于 ``Render > Anti-Aliasing`` 面板上的 ``AA Quality`` 菜单中选择质量配置文件。

source: *None* - disable anti-aliasing,
ru: *None* - антиалиасинг отключен,
zh: *无* - 关闭抗锯齿，

source: *Low*, *Medium*, *High* - enable anti-aliasing with the given quality profile.
ru: *Low*, *Medium*, *High* - применяется антиалиасинг с низкими, средними и высокими параметрами качества соответственно.
zh: *低*，*中*，*高* - 用给定质量配置文件启用抗锯齿。

source: *Medium* profile is used by default.
ru: Значение по умолчанию: *Medium*.
zh: *中* 配置文件默认情况下使用。

source: The anti-aliasing method is assigned simultaneously with the selection of the engine performance profile:
ru: Итоговые настройки сглаживания назначаются композицией выбора профиля качества антиалиасинга и выбора профиля работы движка. При выборе профиля работы движка действуют следующие настройки:
zh: 抗锯齿方法是在引擎性能配置文件选择时同时匹配的：

source: *low quality* - no anti-aliasing,
ru: *низкое качество* - антиалиасинг отключен,
zh: *低质量* - 无抗锯齿，

source: *high quality* and *ultra quality* - use the FXAA 3.11 algorithm (Fast Approximate Anti-Aliasing by Nvidia).
ru: *высокое качество* и *максимальное качество* - использовать алгоритм FXAA 3.11 (Fast Approximate Anti-Aliasing, Nvidia).
zh: *高品质*和*超高品质* - 使用FXAA 3.11算法（Nvidia公司的快速近似抗锯齿）。

source: motion blur
ru: размытие при движении (motion blur)
zh: 运动模糊

source: depth of field
ru: глубина резкости камеры (depth of field)
zh: 景深

source: DOF
zh: 景深，DOF

source: screen-space ambient occlusion
ru: взаимное затенение (screen-space ambient occlusion)
zh: 屏幕空间环境光遮蔽

source: crepuscular rays
ru: сумеречные лучи (crepuscular rays)
zh: 曙暮辉

source: god rays
ru: Сумеречные лучи
zh: 上帝光芒

source: outline glow
ru: подсветка контура (outline glow)
zh: 轮廓辉光

source: anti-aliasing
ru: сглаживание
zh: 抗锯齿
