Repository: weetgo/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/web_player.po
Languages: ru

source: Web Player
ru: Веб-плеер

source: Table of Contents
ru: Содержание

source: The web player is a special application for rendering models and scenes in a demonstration mode.
ru: Веб-плеер представляет собой специализированное приложение для отображения моделей и сцен в режиме демонстрации.

source: Desktop version:
ru: Десктопная версия:

source: Mobile version:
ru: Мобильная версия:

source: Usage
ru: Использование

source: You can copy the directory containing the web player files, namely ``deploy/apps/webplayer``, from the Blend4Web SDK distribution and deploy it on your website. You can place the exported scene files on your website and specify the path to them (absolute or relative) with the ``load`` web player parameter.
ru: Директорию с файлами веб-плеера ``deploy/apps/webplayer`` можно скопировать из дистрибутива Blend4Web SDK и разместить на сайте. Полученные в результате экспорта файлы сцен можно разместить на сайте и указать путь к ним (абсолютный или относительный) с помощью параметра веб-плеера ``load``.

source: When you export into a single HTML file the web player interface is integrated automatically into it.
ru: При экспорте в единый HTML файл интерфейс веб-плеера интегрируется автоматически.

source: Navigation
ru: Навигация

source: The camera (in the ``Target`` and ``Eye`` modes) is controlled by the mouse with its button pressed or with the keys: ``W``, ``A``, ``S``, ``D``, ``R``, ``F`` (forward, left, back, right, up, down). The ``numpad`` keys are also supported.
ru: Управление камерой (в режимах ``Target`` и ``Eye``) осуществляется мышью с нажатой кнопкой, а также клавишами ``W``, ``A``, ``S``, ``D``, ``R``, ``F``: вперед, влево, назад, вправо, вверх, вниз. Также поддерживаются стрелки и клавиши ``numpad``.

source: Control Panel
ru: Панель управления

source: The web player's control panel is shown below.
ru: Ниже показана панель управления веб-плеера.

source: show / hide control panel;
ru: показ / скрытие панели управления;

source: fullscreen mode on / off;
ru: включение / выключение полноэкранного режима;

source: stereo rendering on / off;
ru: включение / выключение стереоизображения;

source: set the scene quality;
ru: установка качества сцены;

source: sound on / off;
ru: включение / выключение звука;

source: camera auto rotation mode on / off;
ru: включение / выключение автоматического поворота камеры вокруг сцены;

source: run / stop the engine;
ru: запуск / остановка движка;

source: open the help window;
ru: открытие окно помощи;

source: tweet;
ru: кнопка Твиттер;

source: share via Facebook;
ru: кнопка Facebook;

source: share via Google+;
ru: кнопка Google+;

source: share via VK;
ru: кнопка ВКонтакте;

source: share via Weibo.
ru: кнопка Weibo.

source: Attributes
ru: Атрибуты

source: Web player accepts attributes from the browser address line:
ru: Веб-плеер принимает атрибуты из адресной строки браузера:

source: the special attribute ``load`` is used to load the scene, this attribute contains relative path to a JSON file.
ru: для загрузки сцены используется обязательный атрибут ``load``, в который помещается относительный путь к JSON файлу.

source: in case of a WebGL error the optional ``fallback_image`` attribute is used to setup the background image instead of 3D content.
ru: необязательный атрибут ``fallback_image`` используется для установки фона, заменяющего сцену при возникновении ошибки WebGL.

source: in case of a WebGL error the optional ``fallback_video`` attribute is used to setup the background video instead of 3D content. Can be used many times to add more video formats.
ru: необязательный атрибут ``fallback_video`` используется для установки видео, заменяющего сцену при возникновении ошибки WebGL. Может использоваться неоднократно с целью добавления видео файлов различных форматов.

source: the optional ``show_fps`` attribute is used to display the FPS counter in the player's top right corner.
ru: необязательный атрибут ``show_fps`` применяется для отображения счетчика кадров в секунду в правом верхнем углу плеера.

source: optional parameter ``autorotate`` is used to enable automatic camera rotation just after the scene loads.
ru: необязательный атрибут ``autorotate`` используется для включения автоматического вращения камеры сразу после загрузки сцены.

source: the ``compressed_textures`` optional parameter is used to enable loading of minified and compressed textures (in DDS format).
ru: необязательный атрибут ``compressed_textures`` используется для включения загрузки уменьшенных текстур и текстур в формате с компрессией (DDS).

source: the ``compressed_textures_pvr`` optional parameter is used to enable loading of textures compressed in PVRTC format. This parameter is used with the ``compressed_textures`` parameter.
ru: необязательный атрибут ``compressed_textures_pvr`` используется для включения загрузки текстур с компрессией PVRTC. Применяется совместно с атрибутом ``compressed_textures``.

source: the ``compressed_gzip`` optional parameter is used to enable loading of GZIP compressed resources such as ".json.gz", ".bin.gz", ".dds.gz" and ".pvr.gz".
ru: необязательный атрибут ``compressed_gzip`` используется для включения загрузки сжатых при помощи GZIP ресурсов, таких как ".json.gz", ".bin.gz", ".dds.gz" и ".pvr.gz".

source: optional ``alpha`` parameter is used to enable transparency for the rendering area.
ru: необязательный атрибут ``alpha`` используется для установки прозрачности области отрисовки.

source: the optional ``no_social`` attribute is used to disable social networks buttons on the control panel.
ru: необязательный атрибут ``no_social`` используется для отключения кнопок социальных сетей на панели управления.

source: the optional ``socials`` attribute is used to selectively enable and disable social network buttons on the control panel. This attribute should look like ``socials=<...>``, where ``<...>`` is a set of letters corresponding to the social network buttons you want to enable (``f`` for Facebook, ``v`` for VK, ``t`` for Twitter, ``w`` for Weibo and ``g`` for Google+). The order of letters sets the order in which the buttons will appear on the screen.
ru: необязательный атрибут ``socials`` используется для выборочного включения и отключения кнопок социальных сетей, а также для задания порядка, в котором они располагаются на экране. Этот атрибут должен выглядеть так: ``socials=<...>``, где ``<...>`` - набор букв, соответствующих кнопкам социальных сетей, которые вы хотите включить (``f`` - Facebook, ``v`` - VK, ``t`` - Twitter, ``w`` - Weibo, ``g`` - Google+).

source: If both ``fallback_image`` and ``fallback_video`` parameters are specified, the ``fallback_image`` parameter is used.
ru: Если указаны параметры ``fallback_image`` и ``fallback_video``, приоритет имеет ``fallback_image``.

source: Scene Name as Title
ru: Название сцены в заголовке

source: By default the Web Player has the ``Blend4Web Web Player`` title. Assigning the meta tag ``title`` on the scene in Blender you can change that value to something else.
ru: По умолчанию веб-плеер устанавливает тег ``title`` равным ``Blend4Web Web Player``. С помощью мета-тега ``title`` в настройках сцены можно изменить значение по умолчанию.

source: Scene Errors
ru: Ошибки сцены

source: If the player is used incorrectly it displays the corresponding errors.
ru: В случае некорректного использования веб-плеера выводятся сообщения об ошибках.

source: The ``load`` :ref:`attribute <webplayer_attributes>` specifies a wrong path to the JSON file or the file is corrupt.
ru: :ref:`атрибутом <webplayer_attributes>` ``load`` указан неверный путь к JSON файлу или данный файл неисправен;

source: The ``load`` :ref:`attribute <webplayer_attributes>` is not found or is void.
ru: :ref:`атрибут <webplayer_attributes>` ``load`` не найден или его значение пустое;

source: WebGL initialization error. Please, look at :ref:`this page <renderer_not_working>` for the solution.
ru: Ошибка инициализации WebGL. Возможные решения описаны на :ref:`этой странице <renderer_not_working>`.

source: web player
ru: веб-плеер
